// import 'package:aviatraffic/features/stories/data/datasources/i_stories_remote_datasource.dart';
// import 'package:aviatraffic/features/stories/data/models/story_model.dart';

// class MockStoriesRemoteDatasource extends IStoriesRemoteDatasource {
//   @override
//   Future<List<StoryModel>> getStories() async {
//     return [
//       StoryModel(
//         id: 1,
//         imageUrl:
//             'ttp://aero.aleev.online/media/stories/mb/zaprettrav_s47npNw.png',
//         title: 'Паспортный\nконтроль',
//         detailed:
//             'Уважаемые пассажиры!  Информируем Вас, о запрете ввоза на территорию Российской Федерации, лекарственного растения - Гармала (данное растение известно в народе как: ысырык, адырашман, могильник обыкновенный)',
//         description:
//             '<p>в составе которого содержится вещество 1-Метил-7-метокси-9Н-пиридо [3,4 &ndash;b]индол (гармин), являющееся в соответствии с Постановлением Правительства Российской Федерации от 30.06.1998 №681 &ldquo;Об утверждении перечня наркотических средств, психотропных веществ и их прекурсоров, подлежащих контролю в Российской Федерации&rdquo; наркотическим средством. Все действия по ввозу данного растения на территорию Российской Федерации являются уголовным и административным нарушениями по статьям 228,228.1,229.1 Уголовного Кодекса Российской Федерации.</p>',
//       ),
//       StoryModel(
//         id: 1,
//         imageUrl:
//             'ttp://aero.aleev.online/media/stories/mb/zaprettrav_s47npNw.png',
//         title: 'Паспортный\nконтроль',
//         detailed:
//             'Уважаемые пассажиры!  Информируем Вас, о запрете ввоза на территорию Российской Федерации, лекарственного растения - Гармала (данное растение известно в народе как: ысырык, адырашман, могильник обыкновенный)',
//         description:
//             '<p>в составе которого содержится вещество 1-Метил-7-метокси-9Н-пиридо [3,4 &ndash;b]индол (гармин), являющееся в соответствии с Постановлением Правительства Российской Федерации от 30.06.1998 №681 &ldquo;Об утверждении перечня наркотических средств, психотропных веществ и их прекурсоров, подлежащих контролю в Российской Федерации&rdquo; наркотическим средством. Все действия по ввозу данного растения на территорию Российской Федерации являются уголовным и административным нарушениями по статьям 228,228.1,229.1 Уголовного Кодекса Российской Федерации.</p>',
//       ),
//       StoryModel(
//         id: 1,
//         imageUrl:
//             'ttp://aero.aleev.online/media/stories/mb/zaprettrav_s47npNw.png',
//         title: 'Паспортный\nконтроль',
//         detailed:
//             'Уважаемые пассажиры!  Информируем Вас, о запрете ввоза на территорию Российской Федерации, лекарственного растения - Гармала (данное растение известно в народе как: ысырык, адырашман, могильник обыкновенный)',
//         description:
//             '<p>в составе которого содержится вещество 1-Метил-7-метокси-9Н-пиридо [3,4 &ndash;b]индол (гармин), являющееся в соответствии с Постановлением Правительства Российской Федерации от 30.06.1998 №681 &ldquo;Об утверждении перечня наркотических средств, психотропных веществ и их прекурсоров, подлежащих контролю в Российской Федерации&rdquo; наркотическим средством. Все действия по ввозу данного растения на территорию Российской Федерации являются уголовным и административным нарушениями по статьям 228,228.1,229.1 Уголовного Кодекса Российской Федерации.</p>',
//       ),
//       StoryModel(
//         id: 1,
//         imageUrl:
//             'ttp://aero.aleev.online/media/stories/mb/zaprettrav_s47npNw.png',
//         title: 'Паспортный\nконтроль',
//         detailed:
//             'Уважаемые пассажиры!  Информируем Вас, о запрете ввоза на территорию Российской Федерации, лекарственного растения - Гармала (данное растение известно в народе как: ысырык, адырашман, могильник обыкновенный)',
//         description:
//             '<p>в составе которого содержится вещество 1-Метил-7-метокси-9Н-пиридо [3,4 &ndash;b]индол (гармин), являющееся в соответствии с Постановлением Правительства Российской Федерации от 30.06.1998 №681 &ldquo;Об утверждении перечня наркотических средств, психотропных веществ и их прекурсоров, подлежащих контролю в Российской Федерации&rdquo; наркотическим средством. Все действия по ввозу данного растения на территорию Российской Федерации являются уголовным и административным нарушениями по статьям 228,228.1,229.1 Уголовного Кодекса Российской Федерации.</p>',
//       ),
//     ];
//   }
// }
